# Cleaning CSV Files

In [53]:
import pandas as pd
import numpy as np
import string

pd.options.display.max_rows = 50

**Read in Data**

In [54]:
df1 = pd.read_csv('data/glassdoor_ratings1_62.csv')#, index_col=0) #index_col=0 to remove numeric index
df2 = pd.read_csv('data/glassdoor_ratings2_37.csv')#, index_col=0)
df3 = pd.read_csv('data/glassdoor_ratings3_199.csv')#, index_col=0)
df4 = pd.read_csv('data/glassdoor_ratings5_797.csv')#, index_col=0)
df5 = pd.read_csv('data/glassdoor_ratings6_846.csv')#, index_col=0)
df6 = pd.read_csv('data/glassdoor_ratings7_453.csv')#, index_col=0

#Combine data frames
data = pd.concat([df1, df2, df3, df4, df5, df6])

print('Length of data set: ',len(data))
print('Number of duplicates: ', data.duplicated().sum())

Length of data set:  2395
Number of duplicates:  686

In [55]:
#Reset index to see all rows
data.reset_index(inplace=True)

#Check out dataframe
print(data.shape)
data.head()

(2395, 15)

,index,NAME,SIZE,LOCATION_HQ,INDUSTRY,RATING_OVERALL,RATING_DI,RATING_CV,RATING_WL,RATING_SM,RATING_CB,RATING_CO,NUM_REVIEWS,DESCRIPTION,MISSION
0,0,Google,10000+ Employees,"Mountain View, CA",Internet,4.5,4.4,4.4,4.3,4.1,4.5,4.3,"See All 18,362 Reviews",NaN,NaN
1,1,Microsoft,10000+ Employees,"Redmond, WA",Computer Hardware & Software,4.4,4.4,4.3,4.1,4.0,4.1,4.1,"See All 29,389 Reviews",Our drive to change the world unites us!\n\nMi...,NaN
2,2,Apple,10000+ Employees,"Cupertino, CA",Computer Hardware & Software,4.3,4.4,4.3,3.7,3.7,4.3,3.8,"See All 20,851 Reviews",We’re a diverse collective of thinkers and doe...,NaN
3,3,US Air Force,10000+ Employees,"Washington, DC",Federal Agencies,4.2,4.2,4.0,3.3,3.4,4.3,4.2,"See All 16,600 Reviews",The mission of the US Department of the Air Fo...,NaN
4,4,Cisco Systems,10000+ Employees,"San Jose, CA",Computer Hardware & Software,4.2,4.3,4.3,4.2,3.8,4.1,3.9,"See All 21,804 Reviews","#WeAreCisco, where each person is unique, but ...",Mission: Cisco wants you to bring your uniquen...

In [56]:
#Drop duplicate companies by 'NAME' - drops size from 1941 to 1188
data.drop_duplicates(subset='NAME', keep='last', inplace=True)
data = data.drop(['index'], axis=1)

In [57]:
#reset index to begin at 0
data.reset_index(inplace=True)

In [59]:
data

,index,NAME,SIZE,LOCATION_HQ,INDUSTRY,RATING_OVERALL,RATING_DI,RATING_CV,RATING_WL,RATING_SM,RATING_CB,RATING_CO,NUM_REVIEWS,DESCRIPTION,MISSION
0,10,McKinsey & Company,10000+ Employees,"New York, NY",Consulting,4.5,4.4,4.4,3.0,4.1,4.4,4.5,"See All 5,198 Reviews",We work with leaders across sectors to tackle ...,Mission: Our mission is two-fold: to help our ...
1,11,Cornell University,10000+ Employees,"Ithaca, NY",Colleges & Universities,4.5,4.3,4.4,4.0,4.1,4.1,4.2,"See All 1,765 Reviews","Cornell is a private, Ivy League university re...",NaN
2,12,UC Santa Barbara,5001 to 10000 Employees,"Santa Barbara, CA",Colleges & Universities,4.5,4.2,4.3,4.4,4.1,3.7,4.0,"See All 1,049 Reviews","Dude, let's hit the beach! And then we'll hit ...",NaN
3,13,UC Irvine,10000+ Employees,"Irvine, CA",Colleges & Universities,4.4,4.5,4.3,4.0,4.0,3.8,4.0,"See All 1,398 Reviews","Sun, the beach, Nobel Prize winners, and a Sou...",NaN
4,14,Iowa State University,5001 to 10000 Employees,"Ames, IA",Colleges & Universities,4.4,4.2,4.2,4.2,4.0,3.8,3.9,"See All 1,203 Reviews",Attending Iowa State University of Science and...,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1507,2390,dressbarn,10000+ Employees,"Mahwah, NJ","Department, Clothing, & Shoe Stores",3.8,2.7,3.7,3.6,3.0,3.0,2.8,See All 781 Reviews,"At dressbarn, in everything we do, we inspire ...",NaN
1508,2391,JLG Industries\nPart of Oshkosh Corporation,1001 to 5000 Employees,"Mc Connellsburg, PA",Industrial Manufacturing,3.9,3.2,4.0,3.6,3.3,4.1,3.8,See All 211 Reviews,"JLG Industries, Inc. is the world’s leading de...",NaN
1509,2392,CallidusCloud\nAcquired by SAP,1001 to 5000 Employees,"Dublin, CA",Enterprise Software & Network Solutions,3.8,4.7,3.7,3.5,3.4,3.7,3.6,See All 270 Reviews,"CallidusCloud, now part of SAP, is the global ...",NaN
1510,2393,Chevron Phillips Chemical,5001 to 10000 Employees,"The Woodlands, TX",Chemical Manufacturing,3.8,3.1,3.5,3.6,2.9,3.9,3.0,See All 253 Reviews,"You may not realize it, but you’ve likely used...",NaN
1511,2394,Henkels & McCoy,1001 to 5000 Employees,"Blue Bell, PA",Construction,3.8,3.5,3.7,3.0,3.2,3.5,3.2,See All 185 Reviews,"Founded in 1923, Henkels & McCoy, Inc., is a p...",NaN

In [60]:
#drop extra indices
# data = data.drop(['index', 'level_0'], axis=1)
data = data.drop(['index'], axis=1)

## Cleaned indices and duplicates gone

In [61]:
print('Shape: ', data.shape)
data.head()

Shape:  (1512, 14)

,NAME,SIZE,LOCATION_HQ,INDUSTRY,RATING_OVERALL,RATING_DI,RATING_CV,RATING_WL,RATING_SM,RATING_CB,RATING_CO,NUM_REVIEWS,DESCRIPTION,MISSION
0,McKinsey & Company,10000+ Employees,"New York, NY",Consulting,4.5,4.4,4.4,3.0,4.1,4.4,4.5,"See All 5,198 Reviews",We work with leaders across sectors to tackle ...,Mission: Our mission is two-fold: to help our ...
1,Cornell University,10000+ Employees,"Ithaca, NY",Colleges & Universities,4.5,4.3,4.4,4.0,4.1,4.1,4.2,"See All 1,765 Reviews","Cornell is a private, Ivy League university re...",NaN
2,UC Santa Barbara,5001 to 10000 Employees,"Santa Barbara, CA",Colleges & Universities,4.5,4.2,4.3,4.4,4.1,3.7,4.0,"See All 1,049 Reviews","Dude, let's hit the beach! And then we'll hit ...",NaN
3,UC Irvine,10000+ Employees,"Irvine, CA",Colleges & Universities,4.4,4.5,4.3,4.0,4.0,3.8,4.0,"See All 1,398 Reviews","Sun, the beach, Nobel Prize winners, and a Sou...",NaN
4,Iowa State University,5001 to 10000 Employees,"Ames, IA",Colleges & Universities,4.4,4.2,4.2,4.2,4.0,3.8,3.9,"See All 1,203 Reviews",Attending Iowa State University of Science and...,NaN

In [9]:
# #Drop duplicate rows
# data.drop_duplicates(inplace=True)

# #Sanity Check
# print('Length of data set: ',len(data))
# print('Number of duplicates: ', data.duplicated().sum())

In [62]:
#Drop null values from RATING_DI
print('NaN values dropped from RATING_DI: ', data.RATING_DI.isna().sum())
data.dropna(subset=['RATING_DI'], inplace=True)

#Drop null values from DESCRIPTION
print('NaN values dropped from DESCRIPTION: ', data.DESCRIPTION.isna().sum())
data.dropna(subset=['DESCRIPTION'], inplace=True)

NaN values dropped from RATING_DI:  63
NaN values dropped from DESCRIPTION:  39

In [63]:
data.head()

,NAME,SIZE,LOCATION_HQ,INDUSTRY,RATING_OVERALL,RATING_DI,RATING_CV,RATING_WL,RATING_SM,RATING_CB,RATING_CO,NUM_REVIEWS,DESCRIPTION,MISSION
0,McKinsey & Company,10000+ Employees,"New York, NY",Consulting,4.5,4.4,4.4,3.0,4.1,4.4,4.5,"See All 5,198 Reviews",We work with leaders across sectors to tackle ...,Mission: Our mission is two-fold: to help our ...
1,Cornell University,10000+ Employees,"Ithaca, NY",Colleges & Universities,4.5,4.3,4.4,4.0,4.1,4.1,4.2,"See All 1,765 Reviews","Cornell is a private, Ivy League university re...",NaN
2,UC Santa Barbara,5001 to 10000 Employees,"Santa Barbara, CA",Colleges & Universities,4.5,4.2,4.3,4.4,4.1,3.7,4.0,"See All 1,049 Reviews","Dude, let's hit the beach! And then we'll hit ...",NaN
3,UC Irvine,10000+ Employees,"Irvine, CA",Colleges & Universities,4.4,4.5,4.3,4.0,4.0,3.8,4.0,"See All 1,398 Reviews","Sun, the beach, Nobel Prize winners, and a Sou...",NaN
4,Iowa State University,5001 to 10000 Employees,"Ames, IA",Colleges & Universities,4.4,4.2,4.2,4.2,4.0,3.8,3.9,"See All 1,203 Reviews",Attending Iowa State University of Science and...,NaN

## Clean up NUM_REVIEWS
- pull out numbers only

In [64]:
def get_digits(s):
    #remove commas
    exclude = set(string.punctuation)
    s = ''.join(num for num in s if num not in exclude)

    #return digits only
    return s.split()[2]

In [65]:
#apply function to NUM_REVIEWS and change datatype to int
data['NUM_REVIEWS'] = data['NUM_REVIEWS'].apply(get_digits).astype(int)

**drop lower than xx reviews**

In [66]:
#removing companies with too few reviews
df = data[(data['NUM_REVIEWS'] < 100)]
df

,NAME,SIZE,LOCATION_HQ,INDUSTRY,RATING_OVERALL,RATING_DI,RATING_CV,RATING_WL,RATING_SM,RATING_CB,RATING_CO,NUM_REVIEWS,DESCRIPTION,MISSION
478,Advantest,1001 to 5000 Employees,"Tokyo, Japan",Electrical & Electronic Manufacturing,4.6,4.5,4.4,4.3,4.2,4.4,4.4,82,"With a long term legacy of success, innovation...",NaN
496,Jean Martin,1001 to 5000 Employees,"New York, NY",IT Services,4.5,4.9,4.4,4.3,4.4,4.2,4.5,89,Jean Martin helps companies meet their busines...,NaN
526,Global Atlantic Financial Group,1001 to 5000 Employees,"New York, NY",Insurance Carriers,4.4,4.2,4.3,4.0,4.3,4.6,4.4,97,Global Atlantic is one of the fastest growing ...,Mission: We strive to be a leading U.S. retire...
915,Public Health Trust,10000+ Employees,"Miami, FL",Health Care Services & Hospitals,4.1,4.5,4.2,4.2,3.9,4.7,3.9,15,The Public Health Trust of Miami-Dade County l...,NaN
1259,Staten Island University Hospital,5001 to 10000 Employees,"Staten Island, NY",Health Care Services & Hospitals,3.9,3.9,3.6,3.4,3.2,4.1,3.8,73,Staten Island University Hospital began as a o...,NaN

## Checking out Rating stats

In [67]:
# Checking out rating stats
data.describe()

,RATING_OVERALL,RATING_DI,RATING_CV,RATING_WL,RATING_SM,RATING_CB,RATING_CO,NUM_REVIEWS
count,1410.000000,1410.000000,1410.000000,1410.000000,1410.000000,1410.000000,1410.000000,1410.000000
mean,3.971915,4.033121,3.893617,3.756383,3.542837,3.735674,3.659787,1383.778723
std,0.316842,0.427068,0.392534,0.407913,0.405387,0.418873,0.380700,3036.839409
min,2.400000,1.000000,1.900000,1.700000,1.900000,2.300000,2.300000,15.000000
25%,3.800000,3.800000,3.700000,3.500000,3.300000,3.500000,3.400000,250.250000
50%,4.000000,4.100000,3.900000,3.800000,3.500000,3.800000,3.700000,525.000000
75%,4.200000,4.300000,4.100000,4.000000,3.800000,4.000000,3.900000,1503.000000
max,4.900000,5.000000,5.000000,4.900000,4.900000,4.900000,4.800000,74066.000000

In [68]:
data.RATING_DI.mean()

4.033120567375886

## Save final CSV